# RelativeRoughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..RelativeRoughness Property
MEPNetworkSegmentData Class See Also
---
The relative roughness of this segment, dimensionless.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double RelativeRoughness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RelativeRoughness As Double
	Get
```

Visual C++
---
```text
public:
property double RelativeRoughness {
	double get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace